I can confirm this: re-running apply breaks on deployments and statefulsets as resources are not deleted when TF tries to re-create them.

Terraform v0.12.16
+ provider.kubernetes v1.10.0

Kubernetes Server Version: version.Info{Major:"1", Minor:"15", GitVersion:"v1.15.2", GitCommit:"f6278300bebbb750328ac16ee6dd3aa7d3549568", GitTreeState:"clean", BuildDate:"2019-08-05T09:15:22Z", GoVersion:"go1.12.5", Compiler:"gc", Platform:"linux/amd64"}

```
kubernetes_secret.api-keys: Refreshing state... [id=po-dev/po-auth-pr-13-api-keys]
kubernetes_config_map.api-config: Refreshing state... [id=po-dev/po-auth-pr-13-api-config]
kubernetes_service.mongo: Refreshing state... [id=po-dev/po-auth-pr-13-mongo]
kubernetes_service.api: Refreshing state... [id=po-dev/po-auth-pr-13-api]
kubernetes_service.bastion: Refreshing state... [id=po-dev/po-auth-pr-13-bastion]
kubernetes_config_map.mongo-initdb: Refreshing state... [id=po-dev/po-auth-pr-13-mongo-initdb]
kubernetes_ingress.ingress: Refreshing state... [id=po-dev/po-auth-pr-13-ingress]
kubernetes_deployment.bastion: Refreshing state... [id=po-dev/po-auth-pr-13-bastion]
kubernetes_deployment.api: Refreshing state... [id=po-dev/po-auth-pr-13-api]
kubernetes_stateful_set.mongo: Refreshing state... [id=po-dev/po-auth-pr-13-mongo]
kubernetes_service.api: Modifying... [id=po-dev/po-auth-pr-13-api]
kubernetes_service.mongo: Modifying... [id=po-dev/po-auth-pr-13-mongo]
kubernetes_config_map.api-config: Modifying... [id=po-dev/po-auth-pr-13-api-config]
kubernetes_secret.api-keys: Modifying... [id=po-dev/po-auth-pr-13-api-keys]
kubernetes_service.bastion: Modifying... [id=po-dev/po-auth-pr-13-bastion]
kubernetes_config_map.mongo-initdb: Modifying... [id=po-dev/po-auth-pr-13-mongo-initdb]
kubernetes_deployment.bastion: Destroying... [id=po-dev/po-auth-pr-13-bastion]
kubernetes_stateful_set.mongo: Destroying... [id=po-dev/po-auth-pr-13-mongo]
kubernetes_deployment.api: Destroying... [id=po-dev/po-auth-pr-13-api]
kubernetes_config_map.api-config: Modifications complete after 1s [id=po-dev/po-auth-pr-13-api-config]
kubernetes_deployment.bastion: Destruction complete after 1s
kubernetes_deployment.api: Destruction complete after 1s
kubernetes_secret.api-keys: Modifications complete after 1s [id=po-dev/po-auth-pr-13-api-keys]
kubernetes_config_map.mongo-initdb: Modifications complete after 1s [id=po-dev/po-auth-pr-13-mongo-initdb]
kubernetes_stateful_set.mongo: Destruction complete after 1s
kubernetes_service.mongo: Modifications complete after 1s [id=po-dev/po-auth-pr-13-mongo]
kubernetes_service.bastion: Modifications complete after 1s [id=po-dev/po-auth-pr-13-bastion]
kubernetes_service.api: Modifications complete after 1s [id=po-dev/po-auth-pr-13-api]
kubernetes_ingress.ingress: Modifying... [id=po-dev/po-auth-pr-13-ingress]
kubernetes_ingress.ingress: Modifications complete after 0s [id=po-dev/po-auth-pr-13-ingress]
kubernetes_deployment.api: Creating...
kubernetes_stateful_set.mongo: Creating...
kubernetes_deployment.bastion: Creating...
kubernetes_stateful_set.mongo: Creation complete after 1s [id=po-dev/po-auth-pr-13-mongo]

Error: Failed to create deployment: object is being deleted: deployments.apps "po-auth-pr-13-api" already exists

  on api.tf line 36, in resource "kubernetes_deployment" "api":
  36: resource "kubernetes_deployment" "api" {

Error: Failed to create deployment: object is being deleted: deployments.apps "po-auth-pr-13-bastion" already exists

  on bastion.tf line 39, in resource "kubernetes_deployment" "bastion":
  39: resource "kubernetes_deployment" "bastion" {
```

```
  # kubernetes_deployment.api must be replaced
-/+ resource "kubernetes_deployment" "api" {
      ~ id = "po-dev/po-auth-pr-13-api" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          ~ labels           = {
                "branch"  = "pr-13"
              ~ "commit"  = "b84cbe5" -> "cea0577"
                "project" = "po-auth"
                "role"    = "api"
            }
            name             = "po-auth-pr-13-api"
            namespace        = "po-dev"
          ~ resource_version = "46478541" -> (known after apply)
          ~ self_link        = "/apis/apps/v1/namespaces/po-dev/deployments/po-auth-pr-13-api" -> (known after apply)
          ~ uid              = "bd5470ca-924f-4945-bb0e-0d41815b3aa6" -> (known after apply)
        }

      ~ spec {
            min_ready_seconds         = 0
            paused                    = false
            progress_deadline_seconds = 600
            replicas                  = 1
            revision_history_limit    = 10

          ~ selector {
              ~ match_labels = { # forces replacement
                    "branch"  = "pr-13"
                  ~ "commit"  = "b84cbe5" -> "cea0577"
                    "project" = "po-auth"
                    "role"    = "api"
                }
            }

          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  ~ labels           = {
                        "branch"  = "pr-13"
                      ~ "commit"  = "b84cbe5" -> "cea0577"
                        "project" = "po-auth"
                        "role"    = "api"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = false -> null
                    dns_policy                       = "ClusterFirst"
                    host_ipc                         = false
                    host_network                     = false
                    host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                    restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                    share_process_namespace          = false
                    termination_grace_period_seconds = 30

                  ~ container {
                      - args                     = [] -> null
                        command                  = [
                            "python3",
                            "-B",
                            "services/main.py",
                            "--connection-string",
                            "mongodb://po-auth-pr-13-mongo:27017/po-auth-pr-13?replicaset=po-auth-pr-13",
                        ]
                      ~ image                    = "registry/po-auth/api:b84cbe5" -> "registry/po-auth/api:cea0577"
                        image_pull_policy        = "IfNotPresent"
                        name                     = "api"
                        stdin                    = false
                        stdin_once               = false
                        termination_message_path = "/dev/termination-log"
                        tty                      = false

                      ~ liveness_probe {
                            failure_threshold     = 3
                            initial_delay_seconds = 0
                            period_seconds        = 30
                            success_threshold     = 1
                            timeout_seconds       = 2

                          ~ http_get {
                                path   = "/services/security/healthcheck"
                                port   = "8041"
                                scheme = "HTTP"
                            }
                        }

                      ~ port {
                            container_port = 8041
                          - host_port      = 0 -> null
                            protocol       = "TCP"
                        }

                      ~ readiness_probe {
                            failure_threshold     = 120
                            initial_delay_seconds = 10
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 1

                          ~ http_get {
                                path   = "/services/security/healthcheck"
                                port   = "8041"
                                scheme = "HTTP"
                            }
                        }

                        resources {
                            limits {
                                cpu    = "50m"
                                memory = "150Mi"
                            }

                            requests {
                                cpu    = "10m"
                                memory = "80Mi"
                            }
                        }

                      ~ volume_mount {
                            mount_path        = "/data/config"
                            mount_propagation = "None"
                            name              = "config"
                            read_only         = true
                        }
                      ~ volume_mount {
                            mount_path        = "/data/keys"
                            mount_propagation = "None"
                            name              = "keys"
                            read_only         = true
                        }
                    }

                    image_pull_secrets {
                        name = "docker-registry-secret"
                    }

                    volume {
                        name = "config"

                        config_map {
                            default_mode = "0644"
                            name         = "po-auth-pr-13-api-config"
                        }
                    }
                    volume {
                        name = "keys"

                        secret {
                            default_mode = "0644"
                            optional     = false
                            secret_name  = "po-auth-pr-13-api-keys"
                        }
                    }
                }
            }
        }

      - timeouts {}
    }
```